<a href="https://colab.research.google.com/github/jalexcanon/MujeresDigitales/blob/master/Clase10(MD).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Dataframes**
(conjunto de series)

In [2]:
import pandas as pd
import numpy as np #toma solo datos numericos

In [ ]:
data = np.array([['', "col1", "col2","col3","col4"],
                 ["row1",11,22,33,44],
                 ["row2",55,66,77,88],
                 ["row3",99,1010,1111,1212],
                 ["row4",1313,1414,1515,1616]])

In [ ]:
data

array([['', 'col1', 'col2', 'col3', 'col4'],
       ['row1', '11', '22', '33', '44'],
       ['row2', '55', '66', '77', '88'],
       ['row3', '99', '1010', '1111', '1212'],
       ['row4', '1313', '1414', '1515', '1616']], dtype='<U4')

In [ ]:
df = pd.DataFrame(data=data[1:,1:], index=data[1:,0], columns=data[0,1:])
df

      col1  col2  col3  col4
row1    11    22    33    44
row2    55    66    77    88
row3    99  1010  1111  1212
row4  1313  1414  1515  1616

In [ ]:
print(df.shape) # Forma 4x4
df['col1']['row1'] # coordenadas
type(df['col1']) #conjunto de series. El dataframe solo recibe las columnas, por eso no puedo llamar las filas.

(4, 4)

pandas.core.series.Series

In [ ]:
df.loc['row2','col1']

'55'

In [ ]:
df.iloc[1,0] #no es con nombres sino con n√∫meros

'55'

In [ ]:
for col in df.columns: #para imprimir las columnas
  print(col)

col1
col2
col3
col4

In [ ]:
#Hallar la diagonal - forma manual
print(df)
print(df.iloc[0,0],df.iloc[1,1],df.iloc[2,2],df.iloc[3,3])

      col1  col2  col3  col4
row1    11    22    33    44
row2    55    66    77    88
row3    99  1010  1111  1212
row4  1313  1414  1515  1616
11 66 1111 1616

In [ ]:
#Hallar diagonal con for
for i in range(4): #4x4
  print(df.iloc[i,i])

11
66
1111
1616

In [ ]:
#Hallar diagonal con loc
indices=df.index.to_list()
columnas=df.columns.to_list()
for i in range(4): #4x4
  print(df.loc[indices[i],columnas[i]])

11
66
1111
1616

In [ ]:
df.iloc[0,:].to_list() #la primera fila en lista

['11', '22', '33', '44']

In [ ]:
df.mean() #promedio de cada columna
df.describe() #toma los valores como texto

       col1  col2 col3  col4
count     4     4    4     4
unique    4     4    4     4
top      11  1414   77  1212
freq      1     1    1     1

In [ ]:
print(df)

      col1  col2  col3  col4
row1    11    22    33    44
row2    55    66    77    88
row3    99  1010  1111  1212
row4  1313  1414  1515  1616

In [ ]:
#diagonal superior
for i in range(4):
  print(df.iloc[i,i:]) #: imprime hasta el final

col1    11
col2    22
col3    33
col4    44
Name: row1, dtype: object
col2    66
col3    77
col4    88
Name: row2, dtype: object
col3    1111
col4    1212
Name: row3, dtype: object
col4    1616
Name: row4, dtype: object

In [ ]:
# DataFrame = Matriz
df2 = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]))
print(df2)
print(df2.shape)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9
(3, 3)

In [ ]:
# Serie = data group by variables
series = pd.Series({"Argentina": "Buenos Aires", "Chile": "Santiago de Chile", "Colombia": "Bogot√°", "Peru":"Lima", "Venezuela":"Caracas", "Mexico":"Mexico D.F."})
print(series)
print(series.shape)

Argentina         Buenos Aires
Chile        Santiago de Chile
Colombia                Bogot√°
Peru                      Lima
Venezuela              Caracas
Mexico             Mexico D.F.
dtype: object
(6,)

In [ ]:
series2 = pd.Series({"Argentina": ["Buenos Aires", "Rosario", "La Plata"], "Chile": "Santiago de Chile", "Colombia": ["Bogot√°", "Medellin", "Cali"], "Peru":"Lima", "Venezuela":"Caracas", "Mexico":"Mexico D.F."})
print(series2)
print(series2.shape)

Argentina    [Buenos Aires, Rosario, La Plata]
Chile                        Santiago de Chile
Colombia              [Bogot√°, Medellin, Cali]
Peru                                      Lima
Venezuela                              Caracas
Mexico                             Mexico D.F.
dtype: object
(6,)

In [3]:
#construyendo
df3 = pd.DataFrame(np.array([[1,2,3,4,5], [6,7,8,9,10],[11,12,13,14,15],[16,17,18,19,20],[21,22,23,24,25]]))
print(df3)
print(len(df3.index)) # index of dataframe
print(len(df3.columns)) # Columns of dataframe

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25
5
5

In [ ]:
# Show statistics of my data
df3.describe()

               0          1          2          3          4
count   5.000000   5.000000   5.000000   5.000000   5.000000
mean   11.000000  12.000000  13.000000  14.000000  15.000000
std     7.905694   7.905694   7.905694   7.905694   7.905694
min     1.000000   2.000000   3.000000   4.000000   5.000000
25%     6.000000   7.000000   8.000000   9.000000  10.000000
50%    11.000000  12.000000  13.000000  14.000000  15.000000
75%    16.000000  17.000000  18.000000  19.000000  20.000000
max    21.000000  22.000000  23.000000  24.000000  25.000000

In [5]:
df4 = pd.DataFrame(np.random.randint(0,50,size=(100,5)))
df4.describe()

                0           1           2          3           4
count  100.000000  100.000000  100.000000  100.00000  100.000000
mean    24.770000   24.860000   22.720000   24.35000   23.520000
std     14.321598   14.856907   14.559582   15.09992   14.951423
min      0.000000    0.000000    0.000000    0.00000    0.000000
25%     11.750000   13.000000    9.000000   13.00000   10.750000
50%     28.000000   26.500000   22.500000   24.50000   23.000000
75%     35.000000   37.000000   35.000000   38.00000   36.000000
max     49.000000   49.000000   48.000000   49.00000   49.000000

In [6]:
df4.corr()

          0         1         2         3         4
0  1.000000  0.146491 -0.062609 -0.101402 -0.070667
1  0.146491  1.000000 -0.075412  0.086985  0.011972
2 -0.062609 -0.075412  1.000000 -0.008142  0.087911
3 -0.101402  0.086985 -0.008142  1.000000 -0.126090
4 -0.070667  0.011972  0.087911 -0.126090  1.000000

In [9]:
df4.count() # Count of not null elements

0    0
1    0
2    0
3    0
4    0
dtype: int64

In [10]:
df4.max() # Max Value

0    49
1    49
2    48
3    49
4    49
dtype: int64

In [11]:
df4.min() # Min value

0    0
1    0
2    0
3    0
4    0
dtype: int64

In [12]:
df4.mean() # Mean of all data

0    24.77
1    24.86
2    22.72
3    24.35
4    23.52
dtype: float64

In [13]:
df4.std() # Standard Deviation

0    14.321598
1    14.856907
2    14.559582
3    15.099920
4    14.951423
dtype: float64

In [14]:
df4.median() # Middle Value

0    28.0
1    26.5
2    22.5
3    24.5
4    23.0
dtype: float64

In [15]:
df4[0] # Column

0      6
1      5
2     25
3     38
4     42
      ..
95    29
96    25
97    12
98    35
99     5
Name: 0, Length: 100, dtype: int64

In [16]:
df4[[0,2,4]] # Two or more Columns

     0   2   4
0    6  40  28
1    5  45  40
2   25   3  12
3   38  35  28
4   42  43  45
..  ..  ..  ..
95  29  29  16
96  25  29  11
97  12  30  25
98  35  21  20
99   5   8  42

[100 rows x 3 columns]

In [ ]:
df4.iloc[0][2] # same as M[0,2] Row 0 column 2

In [ ]:
df4.loc[0] # Row 0 all columns

In [ ]:
df4.iloc[0,:] # Row 0 all

In [ ]:
df4.iloc[0,:] = [None,None,None,None,None]

In [ ]:
df4.isnull()

In [ ]:
df4.isnull().sum()